lvx/extension/DataProcessors/бит_ЗагрузкаДанныхВРегистрСтруктурыХраненияУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗагрузкаДанныхВРегистрСтруктурыХраненияУпаковок</Name>
			<Comment>ЛТ6.3 [Микляев К.А.]</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

lvx/extension/InformationRegisters/бит_СтруктурыХраненияУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтруктурыХраненияУпаковок</Name>
			<Comment>ЛТ6.3 [Микляев К.А.]</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СодержимоеУпаковкиПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлинаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МассаКг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемМ3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВсегоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/extension/DataProcessors/бит_ЗагрузкаДанныхВРегистрСтруктурыХраненияУпаковок/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияРазмеров) Тогда
		ЕдиницаИзмеренияРазмеров = "см";
	КонецЕсли;
	
	Элементы.ЕдиницаИзмеренияРазмеров.СписокВыбора.Очистить();
	Элементы.ЕдиницаИзмеренияРазмеров.СписокВыбора.Добавить("мм", "мм");
	Элементы.ЕдиницаИзмеренияРазмеров.СписокВыбора.Добавить("см", "см");
	Элементы.ЕдиницаИзмеренияРазмеров.СписокВыбора.Добавить("м", "м");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДанныеЗагрузки");
	ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеЗагрузки.Ошибка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.FireBrick);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)

	ПоказатьДиалогЗагрузкиВнешнегоФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьДиалогЗагрузкиВнешнегоФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогЗагрузкиВнешнегоФайла()
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Фильтр = "Файл Excel (*.xlsx)|*.xlsx";
	ПараметрыЗагрузки.Диалог.Заголовок = "Загрузить из внешнего файла";
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзВнешнегоФайлаЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки, ПутьКФайлу);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайлаЗавершение(ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйФайл <> Неопределено Тогда
		ПутьКФайлу = ВыбранныйФайл.Имя;
		АдресФайлаВоВременномХранилище = ВыбранныйФайл.Хранение;
		ПрочитатьФайлНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ПрочитатьФайлНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Загружено = ЗагрузитьНаСервере();
	Сообщить("Загружено записей: " + Формат(Загружено, "ЧГ=0"));
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере()

	ДанныеЗагрузки.Очистить();
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Не выбран файл загрузки.");
		Возврат;
	КонецЕсли;

	ТабДок = ТабличныйДокументИзВыбранногоФайла();
	КоэффициентРазмеров = КоэффициентПереводаРазмеровВМм(ЕдиницаИзмеренияРазмеров);

	Для НомерСтроки = 2 По ТабДок.ВысотаТаблицы Цикл
		Наименование = СокрЛП(Строка(ТабДок.Область(НомерСтроки, 1).Текст));
		Если ПустаяСтрока(Наименование) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ДанныеЗагрузки.Добавить();
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.НоменклатураТекст = Наименование;
		НоваяСтрока.Артикул = СокрЛП(Строка(ТабДок.Область(НомерСтроки, 2).Текст));
		НоваяСтрока.НомерУпаковки = ЧислоИзСтроки(ТабДок.Область(НомерСтроки, 3).Текст);
		НоваяСтрока.ДлинаМм = Окр(ЧислоИзСтроки(ТабДок.Область(НомерСтроки, 5).Текст) * КоэффициентРазмеров, 2);
		НоваяСтрока.ШиринаМм = Окр(ЧислоИзСтроки(ТабДок.Область(НомерСтроки, 6).Текст) * КоэффициентРазмеров, 2);
		НоваяСтрока.ВысотаМм = Окр(ЧислоИзСтроки(ТабДок.Область(НомерСтроки, 7).Текст) * КоэффициентРазмеров, 2);
		НоваяСтрока.МассаКг = ЧислоИзСтроки(ТабДок.Область(НомерСтроки, 8).Текст);
		Если НоваяСтрока.ДлинаМм <> 0 И НоваяСтрока.ШиринаМм <> 0 И НоваяСтрока.ВысотаМм <> 0 Тогда
			НоваяСтрока.ОбъемМ3 = Окр(НоваяСтрока.ДлинаМм * НоваяСтрока.ШиринаМм * НоваяСтрока.ВысотаМм * 0.000000001, 3);
		Иначе
			НоваяСтрока.ОбъемМ3 = ЧислоИзСтроки(ТабДок.Область(НомерСтроки, 9).Текст);
		КонецЕсли;
		НоваяСтрока.Номенклатура = НайтиНоменклатуру(НоваяСтрока.Артикул, НоваяСтрока.НоменклатураТекст);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			НоваяСтрока.Ошибка = "Номенклатура не найдена";
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьВсегоУпаковокВДанныхЗагрузки();

КонецПроцедуры

&НаСервере
Функция ТабличныйДокументИзВыбранногоФайла()
	
	ТабДок = Новый ТабличныйДокумент;
	Если Не ЗначениеЗаполнено(АдресФайлаВоВременномХранилище) Тогда
		ТабДок.Прочитать(ПутьКФайлу);
		Возврат ТабДок;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Попытка
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		Если ДанныеФайла = Неопределено Тогда
			ВызватьИсключение "Не удалось получить файл из временного хранилища.";
		КонецЕсли;
		ДанныеФайла.Записать(ИмяВременногоФайла);
		ТабДок.Прочитать(ИмяВременногоФайла);
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		УдалитьФайлы(ИмяВременногоФайла);
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ЗагрузитьНаСервере()

	Загружено = 0;
	НоменклатурыДляОбновления = Новый Соответствие;
	Для Каждого СтрокаЗагрузки Из ДанныеЗагрузки Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		УдалитьЗаписиУпаковкиНоменклатуры(СтрокаЗагрузки.Номенклатура, СтрокаЗагрузки.НомерУпаковки);
		МенеджерЗаписи = РегистрыСведений.бит_СтруктурыХраненияУпаковок.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = СтрокаЗагрузки.Номенклатура;
		МенеджерЗаписи.НомерУпаковки = СтрокаЗагрузки.НомерУпаковки;
		МенеджерЗаписи.ВсегоУпаковок = СтрокаЗагрузки.ВсегоУпаковок;
		МенеджерЗаписи.СодержимоеУпаковкиПФ = Справочники.Номенклатура.ПустаяСсылка();
		МенеджерЗаписи.ДлинаМм = СтрокаЗагрузки.ДлинаМм;
		МенеджерЗаписи.ШиринаМм = СтрокаЗагрузки.ШиринаМм;
		МенеджерЗаписи.ВысотаМм = СтрокаЗагрузки.ВысотаМм;
		МенеджерЗаписи.МассаКг = СтрокаЗагрузки.МассаКг;
		МенеджерЗаписи.ОбъемМ3 = СтрокаЗагрузки.ОбъемМ3;
		МенеджерЗаписи.Записать();
		НоменклатурыДляОбновления.Вставить(СтрокаЗагрузки.Номенклатура, Истина);
		Загружено = Загружено + 1;
	КонецЦикла;
	
	Для Каждого ЭлементСоответствия Из НоменклатурыДляОбновления Цикл
		ОбновитьВсегоУпаковокПоНоменклатуре(ЭлементСоответствия.Ключ);
	КонецЦикла;

	Возврат Загружено;

КонецФункции

&НаСервере
Процедура ЗаполнитьВсегоУпаковокВДанныхЗагрузки()
	
	КоличествоПоНоменклатуре = Новый Соответствие;
	Для Каждого СтрокаЗагрузки Из ДанныеЗагрузки Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		КоличествоУпаковок = КоличествоПоНоменклатуре.Получить(СтрокаЗагрузки.Номенклатура);
		Если КоличествоУпаковок = Неопределено Тогда
			КоличествоУпаковок = 0;
		КонецЕсли;
		КоличествоПоНоменклатуре.Вставить(СтрокаЗагрузки.Номенклатура, КоличествоУпаковок + 1);
	КонецЦикла;
	
	Для Каждого СтрокаЗагрузки Из ДанныеЗагрузки Цикл
		Если ЗначениеЗаполнено(СтрокаЗагрузки.Номенклатура) Тогда
			СтрокаЗагрузки.ВсегоУпаковок = КоличествоПоНоменклатуре.Получить(СтрокаЗагрузки.Номенклатура);
		Иначе
			СтрокаЗагрузки.ВсегоУпаковок = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЗаписиУпаковкиНоменклатуры(Номенклатура, НомерУпаковки)
	
	НаборЗаписей = РегистрыСведений.бит_СтруктурыХраненияУпаковок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Отбор.НомерУпаковки.Установить(НомерУпаковки);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьВсегоУпаковокПоНоменклатуре(Номенклатура)
	
	НаборЗаписей = РегистрыСведений.бит_СтруктурыХраненияУпаковок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Прочитать();
	
	КоличествоУпаковок = НаборЗаписей.Количество();
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		ЗаписьНабора.ВсегоУпаковок = КоличествоУпаковок;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиНоменклатуру(Артикул, Наименование)

	Если ЗначениеЗаполнено(Артикул) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка КАК Ссылка ИЗ Справочник.Номенклатура КАК Номенклатура ГДЕ Номенклатура.Артикул = &Артикул");
		Запрос.УстановитьПараметр("Артикул", Артикул);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка КАК Ссылка ИЗ Справочник.Номенклатура КАК Номенклатура ГДЕ Номенклатура.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.Номенклатура.ПустаяСсылка();

КонецФункции

&НаСервереБезКонтекста
Функция ЧислоИзСтроки(Значение)

	СтрокаЗначения = СокрЛП(Строка(Значение));
	Если ПустаяСтрока(СтрокаЗначения) Тогда
		Возврат 0;
	КонецЕсли;
	СтрокаЗначения = СтрЗаменить(СтрокаЗначения, Символы.НПП, "");
	СтрокаЗначения = СтрЗаменить(СтрокаЗначения, " ", "");
	СтрокаЗначения = СтрЗаменить(СтрокаЗначения, ",", ".");
	Возврат Число(СтрокаЗначения);

КонецФункции

&НаСервереБезКонтекста
Функция КоэффициентПереводаРазмеровВМм(ЕдиницаИзмерения)
	
	ЕдиницаИзмерения = НРег(СокрЛП(ЕдиницаИзмерения));
	Если ЕдиницаИзмерения = "м" Тогда
		Возврат 1000;
	ИначеЕсли ЕдиницаИзмерения = "см" Тогда
		Возврат 10;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции
